"# of Cars" = "Anzahl der Fahrzeuge";

"%@ has been submitted" = "%@ wurde gesendet.";

"%@ km" = "%@ km";

"%@ kms" = "%@ km";

"%@ mile" = "%@ Meile";

"%@ miles" = "%@ Meilen";

"general_more_information" = "Mehr";

"general_is" = "ist";